In [1]:
import pandas as pd
import numpy as np

In [4]:
items=[10,30,20,70,90]
columns=pd.Series(items)
print(columns)

0    10
1    30
2    20
3    70
4    90
dtype: int64

In [5]:
for i in range(len(columns)):
    print(columns[i])

10
30
20
70
90

In [6]:
columns.values

array([10, 30, 20, 70, 90], dtype=int64)

In [7]:
type(columns)

pandas.core.series.Series

In [9]:
columns.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
columns[columns>=79]

4    90
dtype: int64

In [11]:
columns[columns>=30][columns<=60]

1    30
dtype: int64

In [13]:
columns[(columns<=50)|(columns>=70)]

0    10
1    30
2    20
3    70
4    90
dtype: int64

In [15]:
week1=pd.Series([29000,31000],index=['sat','sun'])

In [16]:
week2=pd.Series([12000,13000],index=['sat','sun'])

In [17]:
merge=week1+week2

In [18]:
print(merge)

sat    41000
sun    44000
dtype: int64

#### DATAFRAME

In [21]:
grade=[
    [1,"M",98,77,88,84],
    [2,"W",56,97,88,74],
    [1,"M",87,67,78,64],
    [3,"W",45,57,98,94]
]

In [23]:
A=pd.DataFrame(grade)

In [27]:
i_name=['Lee','Kimm','Park','Sin']
c_name=['class','gender','test1','test2','test3','test4']

In [28]:
pd.DataFrame(grade,index=i_name,columns=c_name)

      class gender  test1  test2  test3  test4
Lee       1      M     98     77     88     84
Kimm      2      W     56     97     88     74
Park      1      M     87     67     78     64
Sin       3      W     45     57     98     94

#### 리스트를 원소로 갖는 딕셔너리

In [31]:
grade_dic={
    'class':[1,2,1,3],
    'gender':['M','W',"M","W"],
    'test1':[98,56,87,45],
    'test2':[77,97,67,57],
    'test3':[88,88,78,98],
    'test4':[84,74,64,94]
}
B=pd.DataFrame(grade_dic)

In [34]:
B.index.name='이름'
B.index=["Lee","Kim","Park","Sin"]

In [35]:
B

      class gender  test1  test2  test3  test4
Lee       1      M     98     77     88     84
Kim       2      W     56     97     88     74
Park      1      M     87     67     78     64
Sin       3      W     45     57     98     94

#### csv file read

In [40]:
data=pd.read_csv("https://data.hossam.kr/grade.csv",encoding='euc-kr')

In [41]:
df=pd.DataFrame(data)

In [42]:
df.head(2)

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72

In [43]:
df.set_index("이름")

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [44]:
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88